{
  "name": "Respublic",
  
  "about-party": "О партии",
  "who-are-we": "Кто мы?",
  "party-program-and-party-s-election-program": "Программа партии. Предвыборная программа партии",

  "header-party-faction": "Партийная фракция",
  "header-press-center": "Пресс-центр",
  "header-contacts": "Контакты",
  "header-donations": "ДОНАТЫ",
  "header-authorization": "Авторизация",

  "footer-join-the-party": "Присоединяйтесь к партии",
  "footer-feedback": "ОБРАТНАЯ СВЯЗЬ",
  "footer-donations": "ПОЖЕРТВОВАТЬ СЕЙЧАС",
  "footer-party-respublica": "ПАРТИЯ Respublica",
  "footer-about": "О партии",
  "footer-party-faction": "Партийная фракция",
  "footer-press-center": "Пресс-центр",
  "footer-contacts": "Контакты",
  "footer-team": "КОМАНДА",
  "footer-mazhilis-deputies": "Депутаты Мажилиса",
  "footer-maslikhats-deputies": "Депутаты маслихатов",
  "footer-branches": "Филиалы",
  "footer-respublica-party": "© 2023 партия RESPUBLICA.",
  "footer-all-rights-reserved": "Все права защищены.",
  "footer-marketpalce": "Маркетплейс",

  "intro-new-people": "Новые люди –",
  "intro-new-opportunities": "новые возможности!",
  "party-program-description": "Партия Respublica – это МЕТА-партия.<br> Мы нацелены на структурные преобразования во всех сферах общественной жизни.<br> Мы являемся людьми нового Казахстана, цифровыми номадами!",
  "party-program-forward": "Алға, Қазақстан! Алға, Respublica!",
  "about-us-news": "Новости",
  "about-us-join-the-party": "Вступить в партию",
  "about-us-send-a-request": "Направить обращение",
  "about-us-make-an-appointment": "Записаться на прием",
  "about-us-what-are-we-doing": "Что мы делаем",
  "about-us-what-are-we-doing-text": "Партия Respublica – это партия людей дела. Мы опытные и эффективные управленцы, лидеры с опытом преодоления преград и решения сложных задач.<br> Мы связываем свое будущее с Казахстаном.",
  "about-us-what-are-we-doing-btn": "Узнать больше",
  "about-us-who-are-we": "Кто мы",
  "about-us-who-are-we-text": "Мы не чиновники. Мы – созидатели. Каждый из нас создает тысячи рабочих мест. За каждым – личная история успеха и помощь множеству сограждан найти себя и обрести веру в будущее. Мы молоды, амбициозны и сильны. С нами необходимо считаться, мы создаем тысячи рабочих мест.",
  "about-us-who-are-we-btn": "Узнать больше",
  "about-us-contribute": "Внесите свой вклад",
  "about-us-contribute-text": "На территории всей страны у партии Respublica есть филиалы и действуют депутаты в Мажилисе Парламента и маслихатах всех уровней.<br>  Ваша поддержка будет направлена на организацию работы на местах, усилия по защите избирателей и другие приоритеты.",
  "about-us-contribute-btn": "Узнать больше",
 
  "home-join-the-party": "ВСТУПИТЬ В ПАРТИЮ",
  "home-submit-an-apeal": "ПОДАТЬ ОБРАЩЕНИЕ",
  "home-news": "Новости",
  "home-news-see-all": "Смотреть все",
  "home-announcements": "Закупы, объявления",
  "home-announcements-see-all": "Смотреть все",

  "party-program-title": "Программа партии Respublica",
  "party-program-show-btn": "Посмотреть",
  "party-program-progtam-pdf": "Предвыборная <br> программа партии <br> Respublica",
  "party-program-party-election-program": "Предвыборная <br> программа партии <br> Respublica",
  
  "home-about-party-descritption": "Мы стремимся решать вопросы, волнующие наших избирателей в разных уголках страны. Мы открыты для диалога и намерены действовать активно. Примите участие в нашем собществе, чтобы изменить свою жизнь и жизнь ваших близких.",
  "home-about-party-join-the-party": "Вступить в партию",

  "about-us-page-who-are-we": "Кто мы?",
  "about-us-page-respublica": "RESPUBLICA",
  "about-us-page-resbublica-description": "В переводе с латинского – общее, общественное, государственное дело. Мы нацелены на структурные преобразования во всех сферах жизни общества",
  "about-us-page-metaparty": "МЕТАПАРТИЯ",
  "about-us-page-metaparty-description": "Цифровые номады, люди Нового Казахстана, жители центральной Евразии, ощущающие свою принадлежность к Европе и Азии",
  "about-us-page-our-tasks": "НАШИ ЗАДАЧИ",
  "about-us-page-our-tasks-description": "Достижения нашей страны не должны оставаться в речах политиков. Они должны напрямую отражаться на жизни каждого казахстанца. Пришло время стать счастливыми.",
  "about-us-page-our-priorities": "НАШИ ПРИОРИТЕТЫ",
  "about-us-page-our-priorities-educated-nation": "Образованная нация",
  "about-us-page-happiness-to-be-healthy": "Счастье быть здоровым",
  "about-us-page-kazakh-culture": "Казахстанская культура – основа счастливого общества",
  "about-us-page-prosperous-kazakhstans": "Благополучные казахстанцы",
  "about-us-page-refusal-of-outdated-templates": "Отказ от устаревших шаблонов",
  "about-us-page-our-leaders": "НАШИ ЛИДЕРЫ",
  "about-us-page-our-leaders-description": "Опытные и эффективные управленцы, за каждым - своя история успеха",
  "about-us-page-all-regions-and-districs": "ВСЕ РЕГИОНЫ И РАЙОНЫ",
  "about-us-page-all-regions-and-districs-description": "Каждый город и поселок этой огромной страны: филиалы, депутаты, активисты",

  "about-us-page-party-charter": "Устав партии",
  "about-us-page-alga-respublica": "Алға, Қазақстан! Алға, Respublica!",
  "about-us-page-view-the-charter-btn": "Посмотреть устав",
  "about-us-page-organizational-structure": "Организационная структура аппарата партии «Respublica»",
  "about-us-page-menu-organizational-structure": "Организационная структура",
  "about-us-page-menu-history": "История",
  "about-us-page-menu-party-leaders": "Лидеры партии",

  "about-us-page-party-program-restart-reforma-respublica": "Restart. Reforma. Respublica",
  "about-us-page-party-program-restart-reforma-respublica-subtitle": "программа партии",
  "about-us-page-party-program-restart-reforma-respublica-btn": "Посмотреть PDF",
  "about-us-page-party-program-this-is-new-kazakhstan": "Это Новый Казахстан!",
  "about-us-page-party-program-partys-election-program": "предвыборная программа партии",
  "about-us-page-party-program-this-is-new-kazakhstan-btn": "Посмотреть PDF",

  "history-title": "История",
  "history-date-december": "2022, 3 декабря",
  "history-date-december-text": "Учредительный съезд прошел в городе Алматы 3 декабря 2022 года.<br><br> На съезде принято решение о создании политической партии и утверждено её название - партия «Respublica».<br><br>  Утверждены Устав, Программа партии. Сформирован руководящий орган партии и избраны высшие руководящие лица. Избран контрольно-ревизионный орган партии. Принято решение о создании региональных филилов.<br><br>Председателем партии избран глава компании «Олжа Агро» Айдарбек Ходжаназаров, сопредседателями – предприниматели Бейбит Алибеков, Максим Барышев, Руслан Берденов, Нурлан Коянбаев, Сырымбек Тау, Куаныш Шонбай, Динара Шукижанова.",
  "history-date-january": "2023, 18 января",
  "history-date-january-text": "Общественное объединение «Партия «Respublica» зарегистрировано в Министерстве юстиции Республики Казахстан 18 января 2023 года. Начата регистрация филиалов партии.  ",
  "history-date-february": "2023, 6 февраля",
  "history-date-february-text": "В г.Астана прошел II съезд партии Respublica.<br><br>  Принято решение о выдвижении кандидатов в депутаты Мажилиса Парламента Республики Казахстан восьмого созыва, избираемых по партийным спискам и по одномандатным территориальным избирательным округам.<br><br>  Утверждена Предвыборная программа партии «Respublica».<br><br>  Внесены изменения и дополнения в Устав партии «Respublica».",
  "history-date-march": "2023, 19 марта",
  "history-date-march-text": "По итогам внеочередных выборов депутатов Мажилиса Парламента VIII созыва партия «Respublica» набрала 8,59% голосов избирателей и получила шесть мандатов в нижней палате.<br><br>  Фракция партии «Respublica» зарегистрирована Постановлением Бюро Мажилиса Парламента Республики Казахстан.<br><br>  Решением Собрания партии «Respublica» утвержден список депутатов Фракции.<br><br>  В состав фракции вошли депутаты Ходжаназаров А.А., Берденов Р.А., Куспеков О.Х, Наумова Д.Р., Тау Н., Шукижанова Д.А.<br><br>  На первом заседании депутатов – членов фракции руководителем фракции избран Председатель партии «Respublica» Ходжаназаров А.А.<br><br>  В маслихаты всех уровней от партии «Respublica» избрано 56 депутатов.",
  "history-date-july": "2023, 29 июля",
  "history-date-july-text": "Внеочередной выездной III съезд партии состоялся 29 июля 2023 года в поселке Бурабай Акмолинской области.<br><br>  Решением съезда внесены изменения в Устав партии, утверждены новый состав Центрального совета партии, Правила и состав контрольно-ревизионной комиссии, принято решение о создании молодежного объединения «Respublica jastary».",

  "party-leaders-title":"Лидеры партии",
  "party-leaders-khojanazarov":"Ходжаназаров Айдарбек",
  "party-leaders-khojanazarov-description":"Депутат Мажилиса Парламента Республики Казахстан Член Комитета по аграрным вопросам.<br>  Руководитель партийной фракции",
  "party-leaders-alibekov":"Бейбит Алибеков",
  "party-leaders-alibekov-description":"Сопредседатель партии.<br> Владелец медиа холдинга и издательства Blackberry.<br> Блогер, основатель «Astana Watch Club»",
  "party-leaders-baryshev":"Максим Барышев",
  "party-leaders-baryshev-description":"Сопредседатель партии.<br>  Председатель регионального совета Национальной палаты предпринимателей «Атамекен» по городу Алматы.<br>  Основатель группы компаний \"Учёт\"",
  "party-leaders-berdenov":"Руслан Берденов",
  "party-leaders-berdenov-description":"Сопредседатель партии.<br> Депутат Мажилиса Парламента Республики Казахстан Член Комитета по финансам и бюджету",
  "party-leaders-koyanbaev":"Нурлан Коянбаев",
  "party-leaders-koyanbaev-description":"Сопредседатель партии.<br> Продюсер, актер, телеведущий",
  "party-leaders-tau":"Сырымбек Тау",
  "party-leaders-tau-description":"Сопредседатель партии.<br>  Президент компании «Daco Motors Kazakhstan»",
  "party-leaders-shonby":"Куаныш Шонбай",
  "party-leaders-shonby-description":"Сопредседатель партии.<br> Основатель группы компаний «Shonbay Inc»",
  "party-leaders-shukizhanova":"Динара Шукижанова",
  "party-leaders-shukizhanova-description":"Сопредседатель партии.<br>  Депутат Мажилиса Парламента Республики Казахстан  Член Комитета по экономической реформе и региональному развитию",
 
  "respublica-jastary-title":"Respublica Jastary",
  "respublica-jastary-text-one":"Партия Respublica на внеочередном III съезде приняла решение о создании молодежного объединения «Respublica Jastary». Это движение объединит молодых людей в возрасте от 18 до 35 лет с активной гражданской позицией, занимающихся наукой, спортом, творчеством, предпринимательством и другими направлениями деятельности.<br>  Как отметил председатель партии Айдарбек Ходжаназаров, это очень важное решение. В ходе посещения регионов партийцы встречают огромное количество молодых людей, желающих присоединиться к партии и внести свой вклад в развитие страны. Он подчеркнул, что для партии большая честь быть причастными к становлению неравнодушных людей с активной гражданской позицией.",
  "respublica-jastary-text-two":"Цели молодежного объединения, по словам активиста Мухтара Баймагулова, включают формирование патриотического чувства через популяризацию национальных ценностей, объединение молодежи для реализации предвыборной программы партии и участие в реализации государственной молодежной политики. Объединение также займется формированием молодежного резерва для выдвижения в депутаты маслихатов всех уровней и Мажилиса Парламента. <br>  Партия Respublica ставит перед собой задачи обеспечить равные условия для реализации молодых талантов в регионах, защищать права и интересы молодежи, укреплять семейные ценности и способствовать активному участию молодых людей в государственном управлении.<br>  На съезде определены направления работы молодежного объединения «Respublica jastary», включая профилактику и снижение рисков от увлечения азартными играми и лотереями, создание равного инклюзивного общества для всех, борьбу с наркотиками, пропаганду здорового образа жизни, чтения и образования.",
 
  "filter-published": "Опубликованные",
  "filter-unpublished": "Неопубликованные"
}
