<template>
  <div class="wrapper-main">
    <div>
      <Header />
      <div class="content">
        <div class="title">
          <span>Часто задаваемые вопросы и ответы</span>
        </div>
        <div v-for="(item, idx) of itemsList">
          <div @click="toggle(idx)" class="accordion" :class="{ border: item.active }">
            {{ item.title }}
            <div class="arrow">
              <SvgIcon
                :class="{ rotate: item.active }"
                name="arrow-ouyline-down"
                :viewboxWidth="32"
                :viewboxHeight="32"
              />
            </div>
          </div>
          <div class="panel" :class="{ active: item.active }">{{ item.content }}</div>
        </div>
      </div>
    </div>
    <Footer />
  </div>
</template>
<script setup lang="ts">
import { reactive } from "vue";
import Header from "../../components/uiLanding/layouts/header.vue";
import Footer from "../../components/uiLanding/layouts/footer.vue";

const itemsList = reactive([
  {
    title: "Что нужно для вступления в партию?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },
  {
    title: "Как записаться на прием руководства партии, депутатов фракции партии «Respublica»?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Каковы главная цель и задачи партии?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Подскажите адрес и контакты филиала партии в регионе?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Есть ли у партии депутаты в регионах? Можно ли к ним обратиться?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Что нужно для вступления в партию?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Могу ли я получить помощь от партии в решении своего вопроса?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "Можно ли, не вступая в партию, участвовать в ваших мероприятиях?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  },{
    title: "В нашем городе существует проблема. Может ли партия помочь в ее решении?",
    content:
      "Для вступления в партию нужно ваше желание, а также подтверждение того, что вы не являетесь членом другой партии.Вы можете направить онлайн заявление на вступление в партию. Для этого необходимо ввести ваши ФИО, ИИН, регион, номер контактного телефона. На указанный номер вам придет СМС-уведомление и электронная ссылка на партийный билет.Кроме того, заявление на членство в партию можно подать в региональном филиале партии Respublica.",
    active: false,
  }
]);

const toggle = (idx: any) => {
  itemsList[idx].active = !itemsList[idx].active;
};
</script>
<style scoped lang="scss">
.wrapper-main {
  background-color: #f6f9fd;
}
.content {
  max-width: 1920px;
  margin: 0 auto;
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-bottom: 100px;
}
.title {
  display: flex;
  justify-content: center;
  align-items: center;
  margin: 50px 0;

  & span {
    color: var(--primary-color);
    text-align: center;
    font-size: 36px;
    font-weight: 700;
  }
}
.answers {
  margin-top: 100px;
}
.accordion {
  background-color: var(--white-color);
  color: var(--primary-color);
  cursor: pointer;
  font-size: 25px;
  font-style: normal;
  font-weight: 500;
  line-height: 25px;
  width: 1400px;
  height: 85px;
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding-left: 30px;
  border-radius: 10px;
  margin-top: 15px;
}

.accordion:hover {
  /*background-color: #ccc;*/
  color: var(--accent-color);
}

.panel {
  display: none;
  width: 1400px;
  background-color: var(--white-color);
  overflow: hidden;
  font-size: 20px;
  font-style: normal;
  font-weight: 400;
  line-height: 28px;
  color: rgba(4, 32, 81, 0.8);
  padding: 10px 90px 30px 30px;
  border-radius: 0 0 10px 10px;
  transition: max-height 0.4s ease-out;
}

.active {
  display: block;
}
.arrow {
  margin: 26px 30px 27px 0;
  & svg {
    width: 32px;
    height: 32px;
  }
}
.rotate {
  transform: rotate(180deg);
}
.border {
  border-radius: 10px 10px 0 0;
}
</style>
