<template>
  <div class="wrapper-main">
    <div class="content">
      <Header />
      <section class="landing-block">
        <div class="wrapper landing-wrapper litle">
          <div class="news">
            <div class="news-title">Встречи с избирателями</div>

            <div class="news-preview withZoomPreview-preview">
              <div
                class="news-preview-img bg-cover withZoomPreview-preview-img"
                :style="`background-image: url(/img/uiLanding/about-party/events-2.jpg);`"
              ></div>
            </div>

            <div class="news-text">
              Первая сессия Мажилиса Парламента для фракции "Respublica" была очень
              активной, полной инициатив и борьбы за продвижение своих идей. <br /><br />
              В течение трех месяцев в Парламенте 6 республиканцев – Айдарбек
              Ходжаназаров, Динара Шукижанова, Руслан Берденов, Нургуль Тау, Олжас
              Куспеков и Динара Наумова - инициировали 3 законопроекта, стали авторами 195
              поправок в разные законы, 34 раза выступали на заседаниях Мажилиса,
              руководили 3 рабочими группами по разным законопроектам, более 10 раз
              выезжали в регионы. <br /><br />
              Наибольшая часть озвучиваемых партией вопросов касаются экономики и
              социальной сферы. Мажилисмены ведут борьбу за устранение разницы в
              возможностях жителей села и города, за интересы малого бизнеса и ограничение
              деятельности букмекерских контор и тотализаторов, против распространения
              синтетических наркотиков, против продажи вейпов, против коррупции при выдаче
              водительских удостоверений, за интересы онкобольных и инклюзивное общество.
              <br /><br />
              Депутаты поднимают вопросы и предлагают пути решения в сфере сельского
              хозяйства: демпинг цен зарубежными поставщиками зерна и молочной продукции,
              вопросы экспорта продукции и лизинга сельхозтехники, проблема дефицита
              поливной воды. Также внимание уделяется сфере образования, в частности,
              повышению зарплат и улучшению условий для педагогов в сфере дополнительного
              образования. Объектом внимания республиканцев является создание
              инфраструктуры для электромобилей, улучшение условий для водителей
              автобусов, регулирование движения самокатов и другие актуальные вопросы.
              <br /><br />
              В июле-августе члены фракции партии "Respublica" посещали регионы и вместе с
              партийцами, избранными в местные маслихаты, встречались с жителями.
              Парламентские каникулы предоставили депутатам уникальную возможность глубже
              понять и изучить потребности жителей городов и сел, а также представить свои
              идеи и законодательные инициативы. <br /><br />
              Активное общение с предпринимателями, аграриями, молодежью, местными
              активистами и пенсионерами стало площадкой для обсуждения острых вопросов,
              которые беспокоят казахстанцев. <br /><br />
              Общее количество выездов республиканцев в регионы – 29, и эта цифра будет
              расти, поскольку еще предстоят встречи Нургуль Тау в Алматы и Алматинской,
              Жамбылской областях, Руслана Берденова в областях Абай, Ұлытау,
              Туркестанской и Жамбылской, Динары Шукижановой в Павлодарской области.
              <br /><br />
              В ходе поездок собрано свыше 300 вопросов, озвученных жителями. В том числе
              108 касаются сферы здравоохранения, 60 – развития сельского хозяйства, 42 –
              жилищно-коммунальной сферы, 36 – сферы труда и социальной
              защиты населения, 30 – сферы образования, 30 – развития бизнеса, по 6
              вопросов приходятся на правоохранительную и сферу государтвенных услуг.
              <br /><br />
              Все поднятые вопросы будут проанализированы, обобщены и систематизированы.
              Они лягут в основу работы партийной фракции для их дальнейшего решения через
              обращения в государственные органы и законотворческую деятельность.
              <br /><br />
            </div>
          </div>
        </div>
      </section>
    </div>
    <Footer />
  </div>
</template>
<script setup lang="ts"></script>
<style scoped lang="scss">
.wrapper {
  display: flex;
  flex-direction: column;
  align-items: center;
}

.news {
  margin-bottom: 100px;

  &-title {
    color: var(--primary-color);
    font-size: 36px;
    font-weight: 700;
    margin-bottom: 40px;
  }

  &-text {
    color: var(--primary-color);
    font-size: 22px;
    font-weight: 400;
    line-height: 25px;
    margin-bottom: 30px;
  }

  &-preview {
    width: 100%;
    margin-bottom: 30px;
    border-radius: 10px;

    &-img {
      padding-bottom: 60%;
    }
  }
}
</style>
